config.org
* Spaceline
#+BEGIN_SRC emacs-lisp
  (use-package spaceline
    :ensure t
    :config
    (require 'spaceline-config)
    (setq powerline-default-separator (quote arrow))
    (spaceline-emacs-theme))
#+END_SRC
* Theme
#+BEGIN_SRC emacs-lisp
  (load-theme 'gruvbox-dark-medium t)
#+END_SRC
* Font
#+BEGIN_SRC emacs-lisp
  (set-default-font "Hack 12" nil t)
#+END_SRC

* Simple Configs
#+BEGIN_SRC emacs-lisp
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (setq ns-use-srgb-colorspace t)
  (add-to-list 'load-path' "~/.emacs.d/lisp/")
  (add-to-list 'package-archives '("org" . "https://orgmode.org/elpa/") t)
  (add-hook 'prog-mode-hook 'linum-mode)
#+END_SRC

* Better Defaults
#+BEGIN_SRC emacs-lisp
  (use-package better-defaults
    :ensure t)
#+END_SRC

* Org
#+BEGIN_SRC emacs-lisp
  (use-package org)
  (use-package org-noter
    :ensure t)
#+END_SRC

* Smartparens
#+BEGIN_SRC emacs-lisp

#+END_SRC

* CompanyMode
#+BEGIN_SRC emacs-lisp

#+END_SRC
* Disable ctrl z
#+BEGIN_SRC emacs-lisp
  (global-unset-key (kbd "C-z"))
#+END_SRC
